#define _CRT_SECURE_NO_WARNINGS   1

#include <stdio.h>

//int main()
//{
//	int i = 5 % 2;//---------1 都是整数
//	int j = 5 / 2;//商2余1 ---2
//	float k = 5.0 / 2;
//	printf("%d\n", i);
//	printf("%d\n", j);
//	printf("%lf\n", k);
//	return 0;
//}


//int main()
//{
//	int a = 16;
//	int b = -1;
//	//>>---右移操作符--移动的是二级制位
//	//0000 0000 0000 0000 0000 0000 0001 0000
//	//0000 0000 0000 0000 0000 0000 0000 1000
//	//1.算术右移--右边丢弃，左边补原符号位
//	//2.逻辑右移--右边丢弃，右边补0
//	int c=a >> 10;
//	int d = b >> 4;
//	//原码、反码、补码
//	//存储到内存的是补码
//	//1000 0000 0000 0000 0000 0000 0000 0001--原码
//	//1111 1111 1111 1111 1111 1111 1111 1110--反码
//	//1111 1111 1111 1111 1111 1111 1111 1111--补码
//	
//	//1111
//	//8421=15
//	printf("%d\n", c);
//	printf("%d\n", d);
//	return 0;
//}

//int main()
//{
//	//&-按位与--2进制位
//	//|-按位或--2进制位
//	//^-按位异或--2进制位
//	//负数--补码运算
//	int a = 3;
//	int b = 5;
//	int c = a & b;//有0为0
//	//0000 0011
//	//0000 0101
//	//0000 0001
//	int d = a | b;//有1为1
//	//0000 0011
//	//0000 0101
//	//0000 0111;
//	int e = a ^ b;//相同为0，相异为1
//	//0000 0011
//	//0000 0101
//	//0000 0110
//	printf("%d\n", c);
//	printf("%d\n", d);
//	printf("%d\n", e);
//
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	int b = 5;
//	//int tmp = 0;  临时变量
//	printf("a=%d,b=%d\n", a, b);
//	//tmp = a;
//	//a = b;
//	//b = tmp;
//
//	//加减法---缺陷溢出
//	/*a = a + b;
//	b = a - b;
//	a = a - b;*/
//
//	//异或的放过发
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	//011	110   110
//	//101   101   011
//	//110   011   101
//
//
//	printf("a=%d,b=%d\n", a, b);
//	return 0;
//}

//123
//
//int main()
//{
//	int num = 0;
//	int count = 0;;
//	scanf("%d",&num);
//	//32bit
//	//num&q==1
//	//0000 0011
//	//0000 0001
//	//0000 0001
//
//	//统计num的补码中有几个1
//	//while (num)负数不行
//	//{
//	//	if (num % 2 == 1)
//	//		count++; \
//	//	num = num / 2;
//	//}
//	int i = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (1 == ((num >> i) & 1))
//			count++;
//	}
//	printf("%d", count);
//	return 0;
//}


//int main()
//{
//	//int a = 10;
//	//a = a + 2;
//	//a += 2;//复合赋值符\
//
//	//a = a >> 1;
//	//a >>= 1;
//	//
//	//a = a & 1;
//	//a &= 1;
//
//	//int a = 0;
//	//printf("%d\n", !a);
//	//if (!a)//a为假打印
//	//{
//	//	printf("hehe\n");
//	//}
//
//	/*int a = -5;
//	a = -a;*/
//
//	//int a = 10;
//	//int* p = &a;//取地址操作符
//	//int b=*p;//*解引用操作符
//	//printf("%d\n", b);
//
//	//sizeof  计算的变量所占内存空间的大小，单位是字节
//	return 0;
//}

//int main()
//{
//	short s = 0;
//	int a = 10;
//	printf("%d\n", sizeof(s=a+5));//2
//	printf("%d\n", s);//0
//
//	//int a = 0;
//	//char b = 'w';
//	//int arr[10] = { 0 };
//
//	//printf("%d\n", sizeof(a));
//	//printf("%d\n", sizeof a);
//	//printf("%d\n", sizeof(int));
//
//	//printf("%d\n", sizeof(b));
//	//printf("%d\n", sizeof(char));
//
//	//printf("%d\n", sizeof(arr));//10*4=40
//	//printf("%d\n", sizeof(int [10]));
//}


//int main()
//{
//	//int a = 0;
//	////~按（2进制）取反
//	////0000 0000 0000 0000 0000 0000 0000 0000
//	////1111 1111 1111 1111 1111 1111 1111 1111--补码
//	////1111 1111 1111 1111 1111 1111 1111 1110--反码
//	////1000 0000 0000 0000 0000 0000 0000 0001--原码
//	//printf("%d\n", ~a);
//	//return 0;
//
//	int a = 11;
//	//0000 0000 0000 0000 0000 0000 0000 1011
//	//0000 0000 0000 0000 0000 0000 0000 0100
//	a = a | (1 << 2);
//	//1<<2
//	//0000 0000 0000 0000 0000 0000 0000 1111
//	printf("%d\n", a);
//	//0000 0000 0000 0000 0000 0000 0000 1111
//	//0000 0000 0000 0000 0000 0000 0000 0100
//	//1111 1111 1111 1111 1111 1111 1111 1011
//	//0000 0000 0000 0000 0000 0000 0000 1011
//	a = a & (~(1 << 2));
//	printf("%d\n", a);
//}


//int main()
//{
//	int a = 10;
//	printf("%d\n", a++);//后置++，先使用，后使用
//	printf("%d\n", ++a);//前置++，先++，后使用
//	
//	return 0;
//}

//int main()
//{
//	/*int a = 0;
//	int b = 5;
//	int c = a && b;
//	int d = a || b;
//	printf("%d\n", c);
//	printf("%d\n", d);*/
//
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	//i = a++ && ++ b && d++;
//	i= a++ || ++b ||d++;
//	printf(" a=%d\n b=%d\n c=%d\n d+%d", a, b, c, d);//1,2,3,4  
//	//1 3 3 4
//	return 0;
//}

//int main()
//{
//	int a = 0;
//	int b = 0;
//	//if (a > 5)
//	//	b = 3;
//	//else
//	//	b = -3;
//	int c = 10;
//	int d = 20;
//	b=(a > 5 ? 3 : -3);
//	return 0;
//}

//int main()
//{
//	int a[10] = { 0 };
//	a[4] = 10;
//	return 0;
//}

////创建一个结构体类型-struct Stu
//struct Stu
//{
//	//成员变量
//	char name[20];
//	int age;
//	char id[20];
//};
//
//int main()
//{
//	//使用struct Stu这个类型创建了一个学生对象s1，并初始化
//	struct Stu s1 = { "张三",20,"20162416" };
//	struct Stu* ps = &s1;
//	//
//	printf("%s\n", ps->name);
//	printf("%s\n", ps->age);
//	printf("%s\n"), (*ps).name);
//	printf("%s\n"), (*ps).age);
//
//	return 0;
//}

//int main()
//{
//	char a = 3;
//	//0000 0000 0000 0000 0000 0000 0000 0011
//	//0000 0011 ---a
//	char b = 127;
//	//0000 0000 0000 0000 0000 0000 0111 1111
//	//0111 1111 ---b
//	char c = a + b;
//	//0000 0011 
//	//0111 1111
//	//a和b如何相加
//	//0000 0000 0000 0000 0000 0000 0000 0011
//	//0000 0000 0000 0000 0000 0000 0111 1111
//	//0000 0000 0000 0000 0000 0000 1000 0010 
//	//1000 0010 ---c
//	//1111 1111 1111 1111 1111 1111 1000 0010
//	//1111 1111 1111 1111 1111 1111 1000 0001
//	//1000 0000 0000 0000 0000 0000 0111 1110
//	printf("%d\n", c);//-126
//	
//	return 0;
//}

//int main()
//{
//	char a = 0xb6;
//	short b = 0xb600;
//	int c = 0xb6000000;
//
//
//	return 0;
//}


//int main()
//{
//	int a = 10;
//	int b = 20;
//	int c= b + a * 3;
//	printf("%d\n", c);
//	return 0;
//}

//int main()
//{
//	//int a = 10;
//	//int* p=&a;//指针变量
//	//*p = 20;
//
//	/*printf("%d\n", sizeof(char*));
//	printf("%d\n", sizeof(short));
//	printf("%d\n", sizeof(int*));
//	printf("%d\n", sizeof(double*))*/;
//
//
//    int a = 0x11223344;//指针类型的意义
//	int* pa=&a;//访问4个字节
//	char* pc=&a;//访问1个字节
//	printf("%p\n", pa);
//	printf("%p\n", pc);
//	//指针类型决定了指针进行解引用操作的时候，能够访问空间的大小。
//	return 0;
//}

int main()
{
	//指针类型决定了指针的步长
	int a = 0x11223344;
	int* pa = &a;
	char* pc = &a;
	printf("%p\n", pa);
	printf("%p\n", pa+1);

	printf("%p\n", pc);
	printf("%p\n", pc+1);

	int arr[10] = { 0 };
	//int* p=arr;//数组名-首元素的地址
	char* p = arr;
	int i = 0;
	for (i = 0; i < 10; i++)
	{
		*(p + i) = 1;
	}
	printf("%d", arr[0]);
	return 0;
}